# Aggregations

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset occupation.csv from the folder or [here](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [2]:
users=pd.read_csv("C:/Users/Vishal/Desktop/Python/2. Pandas Basic Exercises/Exercise Data Files/Pandas Exercise Aggregation Files/occupation.csv",sep="|")

### Step 3. Assign it to a variable called users.

In [3]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [4]:
users.groupby('occupation')[['age']].mean().reset_index().head(2)

      occupation        age
0  administrator  38.746835
1         artist  31.392857

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least.

Use numpy.where() to encode gender column.

In [5]:
b=users.groupby('occupation')[['gender']].count()

a=users.groupby(['occupation','gender']).agg({'gender': 'count'})

In [6]:
c=a.div(b,level='occupation')*100

In [7]:
c.rename(columns={'gender':'GenderMale'},inplace=True)

In [8]:
c.head()

                      GenderMale
occupation    gender
administrator F        45.569620
              M        54.430380
artist        F        46.428571
              M        53.571429
doctor        M       100.000000

### Step 6. For each occupation, calculate the minimum and maximum ages

In [9]:
users.groupby('occupation')[['age']].agg(['min','max']).head()

              age
              min max
occupation
administrator  21  70
artist         19  48
doctor         28  64
educator       23  63
engineer       22  70

### Step 7. For each combination of occupation and gender, calculate the mean age

In [10]:
users.groupby(['occupation','gender'])['age'].mean().reset_index().head()

      occupation gender        age
0  administrator      F  40.638889
1  administrator      M  37.162791
2         artist      F  30.307692
3         artist      M  32.333333
4         doctor      M  43.571429

### Step 8.  For each occupation present the percentage of women and men

In [11]:
x=users.groupby(['occupation','gender']).agg({'gender': 'count'})

In [12]:
y= users.groupby(['occupation']).agg('count')

In [13]:
z=x.div(y,level="occupation")*100

In [14]:
z['gender'].head()

occupation     gender
administrator  F          45.569620
               M          54.430380
artist         F          46.428571
               M          53.571429
doctor         M         100.000000
Name: gender, dtype: float64